read_verilog -sv MODEL/APB_EXE_UNIT_1/*

hierarchy -top apb_slave_exe_w47

flatten apb_slave_exe_w47

synth

abc -g AND,OR,XOR

opt_clean

write_verilog -noattr RTL/APB_slave_exe_unit_w47_rtl.sv

stat -tech cmos
