read_verilog -sv MODEL/SLAVES/exe_unit_w48.sv

copy exe_unit_w48 exe_unit_w48_rtl

hierarchy -top exe_unit_w48_rtl

synth

abc -g AND,OR,XOR

opt_clean

write_verilog -noattr WORK/yosys_output/exe_unit_w48_rtl.sv
    
stat -tech cmos

