read_verilog -sv MODEL/APB_BUS/*.sv MODEL/APB_CONTROLLER/*.sv MODEL/APB_EXE_UNIT_1/*.sv MODEL/APB_EXE_UNIT_2/*.sv

select *

synth
abc -g AND,OR,XOR
opt_clean


write_verilog -noattr synth/exec_unit.sv
